pruebas/results/2025-11-11_00-24-39/S0_master_ro_t1.log
sysbench 1.0.20 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 1
Report intermediate results every 10 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 10s ] thds: 1 tps: 189.97 qps: 3040.86 (r/w/o: 2660.82/0.00/380.05) lat (ms,95%): 6.67 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 1 tps: 201.60 qps: 3225.34 (r/w/o: 2822.14/0.00/403.21) lat (ms,95%): 6.21 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 1 tps: 213.70 qps: 3418.52 (r/w/o: 2991.12/0.00/427.40) lat (ms,95%): 6.09 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 1 tps: 219.29 qps: 3509.72 (r/w/o: 3071.14/0.00/438.58) lat (ms,95%): 5.88 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 1 tps: 235.71 qps: 3771.19 (r/w/o: 3299.76/0.00/471.42) lat (ms,95%): 5.47 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 1 tps: 234.40 qps: 3749.23 (r/w/o: 3280.53/0.00/468.70) lat (ms,95%): 5.88 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            181258
        write:                           0
        other:                           25894
        total:                           207152
    transactions:                        12947  (215.77 per sec.)
    queries:                             207152 (3452.36 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          60.0018s
    total number of events:              12947

Latency (ms):
         min:                                    2.81
         avg:                                    4.63
         max:                                   19.69
         95th percentile:                        6.09
         sum:                                59955.66

Threads fairness:
    events (avg/stddev):           12947.0000/0.00
    execution time (avg/stddev):   59.9557/0.00