pruebas/results/2025-11-11_00-24-39/S0_master_ro_t4.log
sysbench 1.0.20 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 4
Report intermediate results every 10 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 10s ] thds: 4 tps: 880.55 qps: 14091.60 (r/w/o: 12330.10/0.00/1761.50) lat (ms,95%): 5.88 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 4 tps: 888.31 qps: 14213.06 (r/w/o: 12436.44/0.00/1776.62) lat (ms,95%): 6.21 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 4 tps: 904.58 qps: 14474.09 (r/w/o: 12664.92/0.00/1809.16) lat (ms,95%): 6.09 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 4 tps: 964.52 qps: 15432.82 (r/w/o: 13503.78/0.00/1929.04) lat (ms,95%): 5.18 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 4 tps: 948.32 qps: 15172.00 (r/w/o: 13275.47/0.00/1896.54) lat (ms,95%): 5.67 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 4 tps: 1002.37 qps: 16038.14 (r/w/o: 14033.30/0.00/2004.84) lat (ms,95%): 5.09 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            782488
        write:                           0
        other:                           111784
        total:                           894272
    transactions:                        55892  (931.40 per sec.)
    queries:                             894272 (14902.38 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          60.0076s
    total number of events:              55892

Latency (ms):
         min:                                    2.70
         avg:                                    4.29
         max:                                  157.71
         95th percentile:                        5.77
         sum:                               239846.64

Threads fairness:
    events (avg/stddev):           13973.0000/16.08
    execution time (avg/stddev):   59.9617/0.00