pruebas/results/2025-11-11_00-24-39/S0_master_ro_t8.log
sysbench 1.0.20 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 8
Report intermediate results every 10 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 10s ] thds: 8 tps: 1823.46 qps: 29183.01 (r/w/o: 25535.29/0.00/3647.71) lat (ms,95%): 6.09 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 8 tps: 1860.82 qps: 29772.17 (r/w/o: 26050.52/0.00/3721.65) lat (ms,95%): 5.99 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 8 tps: 1953.94 qps: 31262.01 (r/w/o: 27354.12/0.00/3907.89) lat (ms,95%): 5.28 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 8 tps: 1895.67 qps: 30332.63 (r/w/o: 26541.29/0.00/3791.34) lat (ms,95%): 5.77 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 8 tps: 1813.16 qps: 29011.81 (r/w/o: 25385.49/0.00/3626.33) lat (ms,95%): 6.32 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 7 tps: 1933.04 qps: 30923.95 (r/w/o: 27058.37/0.00/3865.58) lat (ms,95%): 5.57 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            1579354
        write:                           0
        other:                           225622
        total:                           1804976
    transactions:                        112811 (1879.96 per sec.)
    queries:                             1804976 (30079.35 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          60.0060s
    total number of events:              112811

Latency (ms):
         min:                                    1.93
         avg:                                    4.25
         max:                                   44.10
         95th percentile:                        5.88
         sum:                               479669.07

Threads fairness:
    events (avg/stddev):           14101.3750/32.05
    execution time (avg/stddev):   59.9586/0.00