pruebas/results/2025-11-11_00-24-39/S0_master_wo_t1.log
sysbench 1.0.20 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 1
Report intermediate results every 10 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 10s ] thds: 1 tps: 100.98 qps: 606.40 (r/w/o: 0.00/404.34/202.07) lat (ms,95%): 17.32 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 1 tps: 85.60 qps: 513.50 (r/w/o: 0.00/342.30/171.20) lat (ms,95%): 19.29 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 1 tps: 85.30 qps: 511.89 (r/w/o: 0.00/341.30/170.60) lat (ms,95%): 18.28 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 1 tps: 86.20 qps: 517.12 (r/w/o: 0.00/344.71/172.41) lat (ms,95%): 19.65 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 1 tps: 83.10 qps: 498.28 (r/w/o: 0.00/332.09/166.19) lat (ms,95%): 20.37 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 1 tps: 78.00 qps: 468.41 (r/w/o: 0.00/312.41/156.00) lat (ms,95%): 21.89 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            0
        write:                           20772
        other:                           10386
        total:                           31158
    transactions:                        5193   (86.53 per sec.)
    queries:                             31158  (519.18 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          60.0122s
    total number of events:              5193

Latency (ms):
         min:                                    3.85
         avg:                                   11.55
         max:                                   63.91
         95th percentile:                       19.65
         sum:                                59982.75

Threads fairness:
    events (avg/stddev):           5193.0000/0.00
    execution time (avg/stddev):   59.9827/0.00